tweeter_app_api/app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("title", "content", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "\"bbhdggevehdvdh\""], ["content", "\"bbnfhbvrhusu\""], ["author", "\"Mr.Tourettes\""], ["created_at", "2021-01-16 18:22:15.710959"], ["updated_at", "2021-01-16 18:22:15.710959"]]
---
    def create
        tweet = Tweet.new(tweet_params)

        if tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "tweets" SET "content" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["content", "\"bbnfhbvrhusu mmhbddrtgf gdtsdygyrdtdrtf fudrsrsduyfyufyu\""], ["updated_at", "2021-01-16 18:27:42.870784"], ["id", 13]]
---
    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)